In [71]:
import pandas as pd

In [72]:
df = pd.read_csv('../data/raw/netflix_titles.csv')

In [73]:
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [74]:
df.shape #Outputs number of rows and columns

(8807, 12)

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [76]:
df.isnull().sum() #returns sum of missing values for each column

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [77]:
df.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [78]:
df['director'].head()

0    Kirsten Johnson
1                NaN
2    Julien Leclercq
3                NaN
4                NaN
Name: director, dtype: object

In [79]:
df[['title', 'type', 'director']].head()

                   title     type         director
0   Dick Johnson Is Dead    Movie  Kirsten Johnson
1          Blood & Water  TV Show              NaN
2              Ganglands  TV Show  Julien Leclercq
3  Jailbirds New Orleans  TV Show              NaN
4           Kota Factory  TV Show              NaN

In [80]:
type(df['director'])

pandas.core.series.Series

In [81]:
df['director'].dtype

dtype('O')

In [82]:
df[df['director'].isnull()][['title', 'type']].head() #Filters rows where directors are missing
                                                      #Shows only title and type columns and displays 5 rows

                                  title     type
1                         Blood & Water  TV Show
3                 Jailbirds New Orleans  TV Show
4                          Kota Factory  TV Show
10  Vendetta: Truth, Lies and The Mafia  TV Show
14      Crime Stories: India Detectives  TV Show

In [83]:
df['type'].value_counts() #Counts how many times a movie or a TV Show appears

type
Movie      6131
TV Show    2676
Name: count, dtype: int64

In [84]:
movies = df[df['type'] == 'Movie'] #Filters only movies
movies.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
6,s7,Movie,My Little Pony: A New Generation,"Robert Cullen, José Luis Ucha","Vanessa Hudgens, Kimiko Glenn, James Marsden, ...",NaN,"September 24, 2021",2021,PG,91 min,Children & Family Movies,Equestria's divided. But a bright-eyed hero be...
7,s8,Movie,Sankofa,Haile Gerima,"Kofi Ghanaba, Oyafunmike Ogunlano, Alexandra D...","United States, Ghana, Burkina Faso, United Kin...","September 24, 2021",1993,TV-MA,125 min,"Dramas, Independent Movies, International Movies","On a photo shoot in Ghana, an American model s..."
9,s10,Movie,The Starling,Theodore Melfi,"Melissa McCarthy, Chris O'Dowd, Kevin Kline, T...",United States,"September 24, 2021",2021,PG-13,104 min,"Comedies, Dramas",A woman adjusting to life after a loss contend...
12,s13,Movie,Je Suis Karl,Christian Schwochow,"Luna Wedler, Jannis Niewöhner, Milan Peschel, ...","Germany, Czech Republic","September 23, 2021",2021,TV-MA,127 min,"Dramas, International Movies",After most of her family is murdered in a terr...

In [85]:
tv_shows = df[df['type'] == 'TV Show']
tv_shows.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
5,s6,TV Show,Midnight Mass,Mike Flanagan,"Kate Siegel, Zach Gilford, Hamish Linklater, H...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"TV Dramas, TV Horror, TV Mysteries",The arrival of a charismatic young priest brin...

In [86]:
df['release_year'].head()

0    2020
1    2021
2    2021
3    2021
4    2021
Name: release_year, dtype: int64

In [87]:
df.groupby('release_year').size().head() #How many netflix titles released that year

release_year
1925    1
1942    2
1943    3
1944    3
1945    4
dtype: int64

In [88]:
df.groupby('release_year').size().sort_values(ascending=False).head() #Sorted in descending order

release_year
2018    1147
2017    1032
2019    1030
2020     953
2016     902
dtype: int64

In [89]:
titles_per_year = df.groupby('release_year').size().reset_index(name='count').sort_values('count', ascending=False) #Creates a DataFrame for readability
titles_per_year.head() #2018 had the most releases

    release_year  count
70          2018   1147
69          2017   1032
71          2019   1030
72          2020    953
68          2016    902

In [90]:
titles_and_type_per_year = df.groupby(['release_year', 'type']).size().reset_index(name='count').sort_values('count', ascending=False)
titles_and_type_per_year.head()

     release_year   type  count
109          2017  Movie    767
111          2018  Movie    767
107          2016  Movie    658
113          2019  Movie    633
115          2020  Movie    517

In [91]:
df.groupby(['release_year', 'type']).size().reset_index(name='count').head(10)

   release_year     type  count
0          1925  TV Show      1
1          1942    Movie      2
2          1943    Movie      3
3          1944    Movie      3
4          1945    Movie      3
5          1945  TV Show      1
6          1946    Movie      1
7          1946  TV Show      1
8          1947    Movie      1
9          1954    Movie      2

In [92]:
df['country'].value_counts().head(10)

country
United States     2818
India              972
United Kingdom     419
Japan              245
South Korea        199
Canada             181
Spain              145
France             124
Mexico             110
Egypt              106
Name: count, dtype: int64

In [93]:
df['country'].isnull().sum() #How many titles dont have a country

np.int64(831)

In [94]:
#Split multi-country entries
countries = df['country'].str.split(', ')
countries.head()

0    [United States]
1     [South Africa]
2                NaN
3                NaN
4            [India]
Name: country, dtype: object

In [95]:
countries.explode().value_counts().head()

country
United States     3689
India             1046
United Kingdom     804
Canada             445
France             393
Name: count, dtype: int64

After splitting and exploding the country column, the United States remains the top producer of Netflix content. However, the ranking of other countries changes, highlighting the importance of properly handling multi-country entries to avoid misleading conclusions

In [96]:
countries_exploded = df[['type', 'country']].dropna()
countries_exploded.head()

      type                                            country
0    Movie                                      United States
1  TV Show                                       South Africa
4  TV Show                                              India
7    Movie  United States, Ghana, Burkina Faso, United Kin...
8  TV Show                                     United Kingdom

In [97]:
countries_exploded['country'] = countries_exploded['country'].str.split(', ')
countries_exploded['country'].head()

0                                      [United States]
1                                       [South Africa]
4                                              [India]
7    [United States, Ghana, Burkina Faso, United Ki...
8                                     [United Kingdom]
Name: country, dtype: object

In [98]:
countries_exploded = countries_exploded.explode('country')
countries_exploded.head()

      type        country
0    Movie  United States
1  TV Show   South Africa
4  TV Show          India
7    Movie  United States
7    Movie          Ghana

In [99]:
country_type_count = countries_exploded.groupby(['country', 'type']).size().reset_index(name='count').sort_values('count', ascending=False)
country_type_count.head(10)

            country     type  count
177   United States    Movie   2751
68            India    Movie    962
178   United States  TV Show    938
174  United Kingdom    Movie    532
28           Canada    Movie    319
53           France    Movie    303
175  United Kingdom  TV Show    272
82            Japan  TV Show    199
56          Germany    Movie    182
153           Spain    Movie    171

In [100]:
type_by_year = df.groupby(['release_year', 'type']).size().reset_index(name='count').sort_values('release_year', ascending=False)
type_by_year.head(10)

     release_year     type  count
118          2021  TV Show    315
117          2021    Movie    277
116          2020  TV Show    436
115          2020    Movie    517
114          2019  TV Show    397
113          2019    Movie    633
112          2018  TV Show    380
111          2018    Movie    767
110          2017  TV Show    265
109          2017    Movie    767

In [103]:
type_by_year['type'].value_counts()

type
Movie      73
TV Show    46
Name: count, dtype: int64

Movies are released across more distinct years than TV Shows, indicating a longer or more consistent production history.

In [104]:
country_type_count['type'].value_counts()

type
Movie      122
TV Show     66
Name: count, dtype: int64

Movies are distributed across more countries than TV Shows, suggesting wider global availability.